#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.backend_func.module.apim_platform_cdc_api_v1.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = "http"
      + description           = "IO CDC PUBLIC API"
      + display_name          = "IO CDC PUBLIC API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-cdc-public-api"
      + path                  = "cdc/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https://io-p-itn-cdc-backend-func-01.azurewebsites.net/api/v1"
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.1
                info:
                  version: 0.0.1
                  title: CdC Backend API
                  x-logo:
                    url: https://io.italia.it/assets/img/io-logo-blue.svg
                  description: |
                    These API serve the microfrontend related to Carta della Cultura
                servers:
                  - url: https://{function-instance-name}.azurewebsites.net
                security:
                  - ApiKeyAuth: []
                paths:
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                  /fauth:
                    get:
                      operationId: fimsAuth
                      parameters:
                        - in: query
                          name: device
                          required: false
                          schema:
                            type: string
                      responses:
                        '301':
                          description: Redirect to openid  provider
                        '500':
                          description: Internal Server error
                  /fcb:
                    get:
                      operationId: fimsCallback
                      parameters:
                        - in: query
                          name: state
                          required: true
                          schema:
                            type: string
                        - in: query
                          name: code
                          required: true
                          schema:
                            type: string
                      responses:
                        '301':
                          description: Redirect to RP Authorize
                        '500':
                          description: Internal Server error
                  /api/v1/authorize:
                    get:
                      operationId: authorize
                      parameters:
                        - in: query
                          name: id
                          required: true
                          schema:
                            type: string
                      responses:
                        '200':
                          description: Session Token successfully retrieved
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/SessionToken'
                        '500':
                          description: Internal Server error
                  /api/v1/requests:
                    get:
                      operationId: getRequest
                      parameters:
                        - in: header
                          name: token
                          required: true
                          schema:
                            type: string
                      responses:
                        #INSERT 200
                        '500':
                          description: Internal Server error
                    post:
                      operationId: insertRequest
                      parameters:
                        - in: header
                          name: token
                          required: true
                          schema:
                            type: string
                      responses:
                        #INSERT 200
                        '500':
                          description: Internal Server error
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: X-Functions-Key
                  schemas:
                    InternalServerError:
                      description: InternalServerError
                      allOf:
                        - $ref: '#/components/schemas/ProblemJson'
                        - type: object
                          properties:
                            status:
                              type: integer
                              enum:
                                - 500
                              example: 500
                              description: >-
                                The HTTP status code generated by the origin server for this
                                occurrence of the problem.
                          required:
                            - status
                    BadRequest:
                      description: Bad Request
                      allOf:
                        - $ref: '#/components/schemas/ProblemJson'
                        - type: object
                          properties:
                            status:
                              type: integer
                              enum:
                                - 400
                              example: 400
                              description: >-
                                The HTTP status code generated by the origin server for this
                                occurrence of the problem.
                          required:
                            - status
                    Unauthorized:
                      description: Unauthorized
                      allOf:
                        - $ref: '#/components/schemas/ProblemJson'
                        - type: object
                          properties:
                            status:
                              type: integer
                              enum:
                                - 401
                              example: 401
                              description: >-
                                The HTTP status code generated by the origin server for this
                                occurrence of the problem.
                          required:
                            - status
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
                    SessionToken:
                      type: object
                      properties:
                        token:
                          type: string
                      required:
                        - token
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: >-
                            A short, summary of the problem type. Written in english and
                            readable
                
                            for engineers (usually not suited for non technical stakeholders and
                
                            not localized); example: Service Unavailable
                        status:
                          type: integer
                          format: int32
                          description: >-
                            The HTTP status code generated by the origin server for this
                            occurrence of the problem.
                          minimum: 100
                          maximum: 600
                          exclusiveMaximum: true
                          example: 200
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.backend_func.module.apim_platform_cdc_api_v1.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-cdc-public-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.backend_func.module.apim_platform_cdc_api_v1.azurerm_api_management_product_api.this["io-cdc-public-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-cdc-public-api"
      + id                  = (known after apply)
      + product_id          = "io-cdc-public-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.backend_func.module.apim_platform_cdc_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for IO CDC"
      + display_name          = "IO CDC PUBLIC API"
      + id                    = (known after apply)
      + product_id            = "io-cdc-public-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # module.backend_func.module.apim_platform_cdc_product.azurerm_api_management_product_policy.this[0] will be created
  + resource "azurerm_api_management_product_policy" "this" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-cdc-public-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../_modules/backend_func/apim_platform_api.tf line 34, in module "apim_platform_cdc_api_v1":
  34:   content_value  = data.http.cdc_backend_func_openapi.body

The attribute "body" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.storage_fe.module.cdc_storage_fe.azurerm_storage_account.this,
  on .terraform/modules/storage_fe.cdc_storage_fe/storage_account.tf line 2, in resource "azurerm_storage_account" "this":
   2: resource "azurerm_storage_account" "this" {

this block has been deprecated and superseded by the
`azurerm_storage_account_static_website` resource and will be removed in v5.0
of the AzureRM provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
